Documents/ПриемкаТоваровНаХранение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПриемкаТоваровНаХранение</Name>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТТМ_УчетСерийныхНомеровПродукции</xr:Item>
			</RegisterRecords>
		</Properties>
	</Document>
</MetaDataObject>

AccumulationRegisters/ТТМ_УчетСерийныхНомеровПродукции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТТМ_УчетСерийныхНомеровПродукции</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ШильдЗаказан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Произведено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРеализации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Реализовано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПриемкаТоваровНаХранение/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура УстановитьСерийныеНомера(Команда)

	// Элемент табличного поля "Товары" берём из коллекции элементов формы
	ЭлТовары = Элементы.Товары.ТекущиеДанные;
	Если ЭлТовары = Неопределено Тогда
		Предупреждение("На форме не найден элемент табличного поля 'Товары'.");
		Возврат;
	КонецЕсли;

	// Текущая строка табличной части
	ТекСтрока = ЭлТовары;

	// Если строка не выбрана — возьмём первую из Объект.Товары (ПутьКДанным = Объект.Товары)
	Если ТекСтрока = Неопределено Тогда
		Если Объект.Товары.Количество() = 0 Тогда
			Предупреждение("В документе нет строк табличной части 'Товары'.");
			Возврат;
		КонецЕсли;
		ТекСтрока = Объект.Товары[0];
	КонецЕсли;

	// Проверки
	Если Не ЗначениеЗаполнено(ТекСтрока.Номенклатура) Тогда
		Предупреждение("В строке не заполнена Номенклатура.");
		Возврат;
	КонецЕсли;

	Если ТекСтрока.Количество <= 0 Тогда
		Предупреждение("Количество должно быть больше нуля.");
		Возврат;
	КонецЕсли;

	ТТМ_ОбеспечитьЗаписьНовогоДокумента();

	// Пакуем параметры только те, что пойдут в РН + служебные
	Парам = Новый Структура;
	Парам.Вставить("ДокОснование",         Объект.Ссылка);
	Парам.Вставить("Количество",           ТекСтрока.Количество);

	// Измерения регистра (серийник вводится в форме)
	Парам.Вставить("Склад",                ?(ЗначениеЗаполнено(ТекСтрока.Склад), ТекСтрока.Склад, Объект.Склад));
	Парам.Вставить("Номенклатура",         ТекСтрока.Номенклатура);
	Парам.Вставить("Назначение",           ТекСтрока.Назначение);

	// Прочие измерения регистра с дефолтами (пользователь может поменять в форме)
	Парам.Вставить("ШильдЗаказан",         Ложь);
	Парам.Вставить("Произведено",          Ложь);
	Парам.Вставить("ДатаПроизводства",     Неопределено);
	Парам.Вставить("ДокументРеализации",   Неопределено);
	Парам.Вставить("Реализовано",          Ложь);   
	
	НайденныйРеквизит = РеквизитСуществует("ТабСерииТоваров");
	Если НайденныйРеквизит = Неопределено Тогда 
		Попытка
			СоздатьТабСерииТоваров();  
		Исключение
			Сообщить("Ошибка создания реквизита ТабСерииТоваров. " + ОписаниеОшибки());
			Возврат;
		КонецПопытки;
	КонецЕсли;
	АдресТаблицыСерийныхНомеров = ЗаполнитьТабСерииТоваров();
	Парам.Вставить("АдресТабСерииТоваров",АдресТаблицыСерийныхНомеров);
	
	ОповещениеЗакрытия = Новый ОписаниеОповещения("ТТМ_ПослеЗакрытияФормыСерий", ЭтотОбъект);
	
	// Открываем форму ввода серийников
	ОткрытьФорму(
		"ОбщаяФорма.ТТМ_ВводСерийныхНомеровСДаннымиИзТЧ",
		Парам,
		ЭтаФорма,
		, , ,
		ОповещениеЗакрытия,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	КонецПроцедуры 
	
&НаКлиенте
Процедура ТТМ_ОбеспечитьЗаписьНовогоДокумента()

// <validation>

	Если Не ЗначениеЗаполнено(Объект.Товары) Тогда
		Возврат;
	КонецЕсли;

// <condition_check>

	Если Объект.Ссылка.Пустая() Тогда
		ПараметрыЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись);
		ЭтаФорма.Записать(ПараметрыЗаписи);
	КонецЕсли;

КонецПроцедуры	
	
&НаСервере
Функция ЗаполнитьТабСерииТоваров()    
	
	ТЗ = ЭтаФорма.ТабСерииТоваров.Выгрузить();
	АдресТабСерийныеНомера = ПоместитьВоВременноеХранилище(ТЗ);
	
	Возврат АдресТабСерийныеНомера;
	
КонецФункции

&НаСервере
Функция СоздатьТабСерииТоваров()
	
	ДобавляемыеРеквизиты = Новый Массив;

	Если РеквизитСуществует("ТабСерииТоваров") = Неопределено Тогда
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("ТабСерииТоваров",Новый ОписаниеТипов("ТаблицаЗначений"),"","ТабСерииТоваров",Ложь));
	КонецЕсли;

	Если РеквизитСуществует("Номенклатура") = Неопределено Тогда
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Номенклатура",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"),"ТабСерииТоваров","Номенклатура",Ложь));
	КонецЕсли;
	Если РеквизитСуществует("КодТМ") = Неопределено Тогда
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("КодТМ",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50,ДопустимаяДлина.Переменная)),"ТабСерииТоваров","Код ТМ",Ложь));
	КонецЕсли;
	Если РеквизитСуществует("УчитыватьСерийныеномера") = Неопределено Тогда
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("УчитыватьСерийныеномера",Новый ОписаниеТипов("Булево"),"ТабСерииТоваров","",Ложь));
	КонецЕсли;
	Если РеквизитСуществует("СерийныйНомер") = Неопределено Тогда
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("СерийныйНомер",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(16,ДопустимаяДлина.Фиксированная)),"ТабСерииТоваров","Серийный номер",Ложь));
	КонецЕсли;
	Если РеквизитСуществует("Реализовано") = Неопределено Тогда
		ДобавляемыеРеквизиты.Добавить(Новый РеквизитФормы("Реализовано",Новый ОписаниеТипов("Булево"),"ТабСерииТоваров","Реализовано",Ложь));
	КонецЕсли;
	
	//ТипРеквизита = Новый ОписаниеТипов("ТаблицаЗначений");
	//РеквизитФормы = Новый РеквизитФормы(
	//		"ТабСерииТоваров", 	  //Имя реквизита формы
	//		ТипРеквизита,   	  //Тип
	//		"",             	  //Путь  (Пусто, "Объект", ИмяТЧ) // например "Объект.Товары"	
	//		"ТабСерииТоваров");	  //Заголовок
		
	//ТипРеквизита = Новый ОписаниеТипов("КолонкаТаблицыЗначений");
	//РеквизитФормы = Новый РеквизитФормы(
	//	"ТабСерииТоваров.Номенклатура",
	//	ТипРеквизита,
	//	"",
	//	"Номенклатура"); 
	//ДобавляемыеРеквизиты.Добавить(РеквизитФормы);
	//
	//ТипРеквизита = Новый ОписаниеТипов("Буелво");
	//РеквизитФормы = Новый РеквизитФормы(
	//	"ТабСерииТоваров.УчитыватьСерийныеномера",
	//	ТипРеквизита,
	//	"",
	//	"Номенклатура"); 
	//ДобавляемыеРеквизиты.Добавить(РеквизитФормы);
			
	//Заставляем форму создать новые реквизиты
	Если ДобавляемыеРеквизиты.Количество() > 0 Тогда
		ИзменитьРеквизиты(ДобавляемыеРеквизиты); 
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция РеквизитСуществует(ИмяРеквизита)
	Попытка
		РеквизитФормыВЗначение(ИмяРеквизита);
		Возврат Истина;
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

&НаСервере
Процедура АРМ1_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
		
	//Добавление команды и кнопки формы
	ТекущийЭлемент = Элементы.Найти("Товары");
	Если ТекущийЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	КомПанель = ТекущийЭлемент.КоманднаяПанель;

	Команда = Команды.Найти("УстановитьСННоменклатуры");
	Если Команда = Неопределено Тогда
		Команда = Команды.Добавить("УстановитьСННоменклатуры"); //Имя команды
		Команда.Заголовок = "СН";
		Команда.Действие  = "УстановитьСерийныеНомера"; //Имя связанной процедуры 
		Команда.Отображение = ОтображениеКнопки.КартинкаИТекст;
		Команда.Картинка = БиблиотекаКартинок.ОформлениеЗнакФлажок;
	КонецЕсли;
	
	//Полный перечень свойств команды в синтакс-помощнике
	//	Интерфейс (управляемый)->Форма клиентского приложения->КомандаФормы
	
	//Добавление кнопки формы
	Если Элементы.Найти("УстановитьСННоменклатуры") = Неопределено Тогда
		КнопкаФормы = Элементы.Добавить(
			"УстановитьСННоменклатуры", //Имя кнопки
			Тип("КнопкаФормы"),             //Тип, всегда КнопкаФормы
			КомПанель);                      //Контейнер для кнопки (Форма, Группа, Командная панель)
		КнопкаФормы.ИмяКоманды = "УстановитьСННоменклатуры"; //Связь с командой по имени  
	КонецЕсли;
	
	ЭлементСтраницы = Элементы.Найти("ГруппаСтраницы");
	Если ЭлементСтраницы = Неопределено Тогда 
		Сообщить("Элемент Формы ""ГруппаСтраницы"" больше не существует! Необходимо изменить размещение элементов, добавляемых программно!");
		Возврат;
	КонецЕсли;           
	
	СоздатьТабСерииТоваров();
	
	ЭлементСтраницаСерийныеНомера = Элементы.Найти("ТТМ_СтраницаСерийныеНомера");
	Если ЭлементСтраницаСерийныеНомера = Неопределено Тогда 
		ЭлементСтраницаСерийныеНомера = Элементы.Добавить("ТТМ_СтраницаСерийныеНомера",Тип("ГруппаФормы"),ЭлементСтраницы);
		ЭлементСтраницаСерийныеНомера.Вид = ВидГруппыФормы.Страница;
		ЭлементСтраницаСерийныеНомера.Заголовок = "Серии";
	КонецЕсли;

	ЭлементТабСерийныеНомера = Элементы.Найти("ТТМ_ТабСерииТоваров");
	Если ЭлементТабСерийныеНомера = Неопределено Тогда
		ЭлементТабСерийныеНомера = Элементы.Добавить("ТТМ_ТабСерииТоваров",Тип("ТаблицаФормы"),ЭлементСтраницаСерийныеНомера);
	КонецЕсли;
	ЭлементТабСерийныеНомера.ПутьКДанным = "ТабСерииТоваров";
	ТТМ_ОбеспечитьКолонкиТабСерии(ЭлементТабСерийныеНомера);
	ТТМ_УстановитьУсловноеОформлениеТабСерии();
	
	//Возможные варианты вида кнопки:
	//	-Гиперссылка
	//	-ГиперссылкаКоманднойПанели
	//	-КнопкаКоманднойПанели
	//	-ОбычнаяКнопка
	//Если контейнер для формы - командная панель
	//то вид кнопки должен быть КнопкаКоманднойПанели
	
	//Полный перечень свойств кнопки формы в синтакс-помощнике
	//	Интерфейс (управляемый)->Кнопка формы
	
	////////////////////////////////////////////////////////////////
	
	ЗаполнитьСерийныеномераПоРегистру();
	ТТМ_ИнициализироватьКолонкуСерий();
	
КонецПроцедуры

&НаСервере
Процедура ТТМ_ОбеспечитьКомандуОтгрузкиСХранения(КомПанель)

	КомандаОтгрузки = Команды.Найти("ТТМ_СоздатьОтгрузкуСХраненияНаОсновании");
	Если КомандаОтгрузки = Неопределено Тогда
		КомандаОтгрузки = Команды.Добавить("ТТМ_СоздатьОтгрузкуСХраненияНаОсновании");
		КомандаОтгрузки.Заголовок = "Отгрузка с хранения";
		КомандаОтгрузки.Действие = "ТТМ_СоздатьОтгрузкуСХраненияНаОсновании";
		КомандаОтгрузки.Отображение = ОтображениеКнопки.Текст;
	КонецЕсли;

	РодительКоманды = Элементы.Найти("ПодменюСоздатьНаОснованииОбычное");
	Если РодительКоманды = Неопределено Тогда
		РодительКоманды = КомПанель;
	КонецЕсли;

	Если Элементы.Найти("ТТМ_КнопкаСоздатьОтгрузкуСХраненияНаОсновании") = Неопределено Тогда
		КнопкаФормы = Элементы.Добавить(
			"ТТМ_КнопкаСоздатьОтгрузкуСХраненияНаОсновании",
			Тип("КнопкаФормы"),
			РодительКоманды);
		КнопкаФормы.ИмяКоманды = "ТТМ_СоздатьОтгрузкуСХраненияНаОсновании";
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ТТМ_ОбеспечитьКолонкиТабСерии(ЭлементТабСерийныеНомера)
	Если Элементы.Найти("ТТМ_ТабСерии_Номенклатура") = Неопределено Тогда
		Колонка = Элементы.Добавить("ТТМ_ТабСерии_Номенклатура", Тип("ПолеФормы"), ЭлементТабСерийныеНомера);
		Колонка.Вид = ВидПоляФормы.ПолеВвода;
		Колонка.ПутьКДанным = "ТабСерииТоваров.Номенклатура";
		Колонка.Заголовок = "Номенклатура";
	КонецЕсли;

	Если Элементы.Найти("ТТМ_ТабСерии_СерийныйНомер") = Неопределено Тогда
		Колонка = Элементы.Добавить("ТТМ_ТабСерии_СерийныйНомер", Тип("ПолеФормы"), ЭлементТабСерийныеНомера);
		Колонка.Вид = ВидПоляФормы.ПолеВвода;
		Колонка.ПутьКДанным = "ТабСерииТоваров.СерийныйНомер";
		Колонка.Заголовок = "СерийныйНомер";
	КонецЕсли;

	Если Элементы.Найти("ТТМ_ТабСерии_Реализовано") = Неопределено Тогда
		Колонка = Элементы.Добавить("ТТМ_ТабСерии_Реализовано", Тип("ПолеФормы"), ЭлементТабСерийныеНомера);
		Колонка.Вид = ВидПоляФормы.ПолеФлажка;
		Колонка.ПутьКДанным = "ТабСерииТоваров.Реализовано";
		Колонка.Заголовок = "Реализовано";
		Колонка.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ТТМ_УстановитьУсловноеОформлениеТабСерии()

	НовыйЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ОформлениеЦветТекста = НовыйЭлементУсловногоОформления.Оформление.Элементы.Найти("ЦветТекста");
	ОформлениеЦветТекста.Значение = WebЦвета.Красный;
	ОформлениеЦветТекста.Использование = Истина;

	НастройкаОтбора = НовыйЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НастройкаОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТабСерииТоваров.Реализовано");
	НастройкаОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	НастройкаОтбора.ПравоеЗначение = Истина;

	ОформляемоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТТМ_ТабСерииТоваров");
	ОформляемоеПоле.Использование = Истина;

	НовыйЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	ОформлениеЦветТекста = НовыйЭлементУсловногоОформления.Оформление.Элементы.Найти("ЦветТекста");
	ОформлениеЦветТекста.Значение = WebЦвета.Зеленый;
	ОформлениеЦветТекста.Использование = Истина;

	НастройкаОтбора = НовыйЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НастройкаОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТабСерииТоваров.Реализовано");
	НастройкаОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	НастройкаОтбора.ПравоеЗначение = Истина;

	ОформляемоеПоле = НовыйЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТТМ_ТабСерииТоваров");
	ОформляемоеПоле.Использование = Истина;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСерийныеномераПоРегистру() 
	
	ТЗ = ЭтаФорма.ТабСерииТоваров.Выгрузить();
	//ТЗ = Элементы.ТТМ_СерийныйНомера.Выгрузить();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	ТТМ_УчетСерийныхНомеровПродукции.Номенклатура КАК Номенклатура,
		|	ТТМ_УчетСерийныхНомеровПродукции.СерийныйНомер КАК СерийныйНомер,
		|	ТТМ_УчетСерийныхНомеровПродукции.Реализовано КАК Реализовано
		|ИЗ
		|	РегистрНакопления.ТТМ_УчетСерийныхНомеровПродукции КАК ТТМ_УчетСерийныхНомеровПродукции
		|ГДЕ
		|	ТТМ_УчетСерийныхНомеровПродукции.Регистратор = &Регистратор";
	Запрос.УстановитьПараметр("Регистратор",Объект.Ссылка);
	ТабДанныеПоСерийнымНомерам = Запрос.Выполнить().Выгрузить();
	//Элементы.ТТМ_СерийныйНомера.Загрузить(ТабДанныеПоСерийнымНомерам);
	ЭтаФорма.ТабСерииТоваров.Загрузить(ТабДанныеПоСерийнымНомерам);
	
КонецПроцедуры

//&НаКлиенте
//Процедура ПослеВводаСерийныхНомеров(Результат, ДопПараметры) Экспорт
//	ЭтаФорма.Обновить();
//КонецПроцедуры


#Область СерийныеНомера_КолонкаСтатуса

// Назначение: Инициализирует программно добавляемые колонки данных формы
//             для табличной части Товары и создает колонку-картинку на форме.
// Параметры: Нет
// Примечания: Дополнительные колонки существуют только в данных формы
//             и не записываются в информационную базу.
&НаСервере
Процедура ТТМ_ИнициализироватьКолонкуСерий()

// <initialization>

	ТТМ_ОбеспечитьРеквизитыКолонкиСерий();
	ТТМ_ОбеспечитьКолонкуСерийНаФорме();

// <data_processing>

	Элементы.Товары.УстановитьДействие("Выбор", "ТТМ_ТоварыВыбор");
	Если Элементы.Найти("ТоварыНоменклатура") <> Неопределено Тогда
		Элементы.ТоварыНоменклатура.УстановитьДействие("ПриИзменении", "ТТМ_ТоварыРеквизитыПриИзменении");
	КонецЕсли;
	Если Элементы.Найти("ТоварыКоличество") <> Неопределено Тогда
		Элементы.ТоварыКоличество.УстановитьДействие("ПриИзменении", "ТТМ_ТоварыРеквизитыПриИзменении");
	КонецЕсли;
	Если Элементы.Найти("ТоварыКоличествоУпаковок") <> Неопределено Тогда
		Элементы.ТоварыКоличествоУпаковок.УстановитьДействие("ПриИзменении", "ТТМ_ТоварыРеквизитыПриИзменении");
	КонецЕсли;
	ТТМ_ЗаполнитьКолонкиСерийНаСервере();

КонецПроцедуры


// Назначение: Создает дополнительные колонки данных формы в табличной части Товары.
// Параметры: Нет
// Примечания: Колонки создаются под реквизитом формы Объект.Товары.
&НаСервере
Процедура ТТМ_ОбеспечитьРеквизитыКолонкиСерий()

// <initialization>

	ДобавляемыеРеквизиты = Новый Массив;

// <data_processing>

	Если РеквизитСуществует("ТТМ_СтатусСерий") = Неопределено Тогда
		ДобавляемыеРеквизиты.Добавить(
			Новый РеквизитФормы(
				"ТТМ_СтатусСерий",
				Новый ОписаниеТипов("Число"),
				"Объект.Товары",
				"Статус серий",
				Ложь));
	КонецЕсли;

	Если РеквизитСуществует("ТТМ_ИндексКартинкиСерий") = Неопределено Тогда
		ДобавляемыеРеквизиты.Добавить(
			Новый РеквизитФормы(
				"ТТМ_ИндексКартинкиСерий",
				Новый ОписаниеТипов("Число"),
				"Объект.Товары",
				"Индекс картинки серий",
				Ложь));
	КонецЕсли;

// <database_write>

	Если ДобавляемыеРеквизиты.Количество() > 0 Тогда
		ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	КонецЕсли;

КонецПроцедуры


// Назначение: Настраивает таблицу Товары для отображения картинок из коллекции
//             TTM_СтатусыСерий по индексу и добавляет отдельную колонку.
// Параметры: Нет
// Примечания: Используется коллекция общей картинки TTM_СтатусыСерий.
&НаСервере
Процедура ТТМ_ОбеспечитьКолонкуСерийНаФорме()

// <initialization>

	ТаблицаТовары = Элементы.Найти("Товары");
	Если ТаблицаТовары = Неопределено Тогда
		Возврат;
	КонецЕсли;

// <data_processing>

	ТаблицаТовары.КартинкаСтрок = БиблиотекаКартинок.ТТМ_СтатусыСерий;
	ТаблицаТовары.ПутьКДаннымКартинкиСтроки = "Объект.Товары.ТТМ_ИндексКартинкиСерий";

	КолонкаСтатуса = Элементы.Найти("ТТМ_КолонкаСерий");
	Если КолонкаСтатуса = Неопределено Тогда
		КолонкаСтатуса = Элементы.Добавить(
			"ТТМ_КолонкаСерий",
			Тип("ПолеФормы"),
			ТаблицаТовары);
	КонецЕсли;

	КолонкаСтатуса.ПутьКДанным = "Объект.Товары.ТТМ_ИндексКартинкиСерий";
	КолонкаСтатуса.Заголовок = "СН";
	КолонкаСтатуса.Доступность = Истина;

КонецПроцедуры

// Назначение: Перезаполняет статусы и индексы картинок серий по всем строкам ТЧ Товары.
// Параметры: Нет
&НаСервере
Процедура ТТМ_ЗаполнитьКолонкиСерийНаСервере()

// <loop_processing>

	Для Каждого СтрокаТоваров Из Объект.Товары Цикл

		СтатусСерий = ТТМ_ПолучитьСтатусСерийСтроки(СтрокаТоваров);
		СтрокаТоваров.ТТМ_СтатусСерий = СтатусСерий;
		СтрокаТоваров.ТТМ_ИндексКартинкиСерий = СтатусСерий;

	КонецЦикла;

КонецПроцедуры


// Назначение: Определяет статус заполнения серий для строки ТЧ.
// Параметры: СтрокаТоваров - ДанныеФормыЭлементКоллекции / строка ТЧ - Строка табличной части Товары
// Возвращаемое: Число - 0: серый; 2: красный; 1: желтый; 3: зеленый
// Примечания: Статус считается по текущему составу ТабСерииТоваров.
&НаСервере
Функция ТТМ_ПолучитьСтатусСерийСтроки(СтрокаТоваров)

// <validation>

	Если Не ЗначениеЗаполнено(СтрокаТоваров.Номенклатура) Тогда
		Возврат 0;
	КонецЕсли;

	Если СтрокаТоваров.Количество <= 0 Тогда
		Возврат 0;
	КонецЕсли;

	Если Не ТТМ_СерийныйУчет.ПроверитьУстановитьУчетСерийныхНомеров(СтрокаТоваров.Номенклатура) Тогда
		Возврат 0;
	КонецЕсли;

// <calculation>

	КоличествоСерий = 0;

	Для Каждого СтрокаСерий Из ТабСерииТоваров Цикл
		Если СтрокаСерий.Номенклатура = СтрокаТоваров.Номенклатура
			И ЗначениеЗаполнено(СтрокаСерий.СерийныйНомер) Тогда

			КоличествоСерий = КоличествоСерий + 1;

		КонецЕсли;
	КонецЦикла;

// <result_formation>

	Если КоличествоСерий = 0 Тогда
		Возврат 2;
	ИначеЕсли КоличествоСерий < СтрокаТоваров.Количество Тогда
		Возврат 1;
	ИначеЕсли КоличествоСерий = СтрокаТоваров.Количество Тогда
		Возврат 3;
	Иначе
		Возврат 2;
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура ТТМ_ТоварыРеквизитыПриИзменении(Элемент)

	ТТМ_ПересчитатьСтатусыСерийНаСервере();
	Элементы.Товары.Обновить();

КонецПроцедуры

&НаСервере
Процедура ТТМ_ПересчитатьСтатусыСерийНаСервере()
	ТТМ_ЗаполнитьКолонкиСерийНаСервере();
КонецПроцедуры


// Назначение: Возвращает картинку по числовому статусу серий.
// Параметры: СтатусСерий - Число - Код статуса
// Возвращаемое: Картинка
// Примечания: В конфигурации должны существовать общие картинки:
//             ТТМ_СерииСерый, ТТМ_СерииКрасный, ТТМ_СерииЖелтый, ТТМ_СерииЗеленый.
&НаСервере
Функция ТТМ_ПолучитьКартинкуСтатусаСерий(СтатусСерий)

// <condition_check>

	Если СтатусСерий = 0 Тогда
		Возврат БиблиотекаКартинок.ТТМ_СтатусыСерий[0];
	ИначеЕсли СтатусСерий = 1 Тогда
		Возврат БиблиотекаКартинок.ТТМ_СтатусыСерий[1];
	ИначеЕсли СтатусСерий = 2 Тогда
		Возврат БиблиотекаКартинок.ТТМ_СтатусыСерий[2];
	Иначе
		Возврат БиблиотекаКартинок.ТТМ_СтатусыСерий[3];
	КонецЕсли;

КонецФункции


// Назначение: Обрабатывает выбор в таблице Товары и открывает форму серий
//             по нажатию на колонку-картинку.
// Параметры: Элемент - ТаблицаФормы - Таблица Товары;
//             ВыбраннаяСтрока - ДанныеФормыСтруктура - Текущая строка;
//             Поле - ПолеФормы - Колонка, по которой был клик;
//             СтандартнаяОбработка - Булево - Признак стандартной обработки.
&НаКлиенте
Процедура ТТМ_ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)


// <validation>
    Итераций = 0;
	Если Поле = Неопределено Тогда
		Возврат;
	КонецЕсли;

// <condition_check>

	Если Поле.Имя = "ТоварыНомерСтроки" и Итераций < 1 Тогда
		СтандартнаяОбработка = Ложь;
		Итераций = Итераций + 1 ;
		ТТМ_ТоварыСерии_Нажатие(Элемент);
	КонецЕсли;

КонецПроцедуры


// Назначение: Открывает форму ввода серий для текущей строки ТЧ Товары.
// Параметры: Элемент - ТаблицаФормы - Таблица Товары
// Примечания: Для строк без серийного учета открытие запрещается.
&НаКлиенте
Процедура ТТМ_ТоварыСерии_Нажатие(Элемент)

// <initialization>

	ТекСтрока = Элементы.Товары.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;

// <validation>

	Если Не ЗначениеЗаполнено(ТекСтрока.Номенклатура) Тогда
		Возврат;
	КонецЕсли;

// <condition_check>

	Если ТекСтрока.ТТМ_СтатусСерий = 0 Тогда
		Возврат;
	КонецЕсли;

// <data_processing>

	ТТМ_ОбеспечитьЗаписьНовогоДокумента();

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ДокОснование", Объект.Ссылка);
	ПараметрыФормы.Вставить("Склад", ?(ЗначениеЗаполнено(ТекСтрока.Склад), ТекСтрока.Склад, Объект.Склад));
	ПараметрыФормы.Вставить("Номенклатура", ТекСтрока.Номенклатура);
	ПараметрыФормы.Вставить("Количество", ТекСтрока.Количество);
	ПараметрыФормы.Вставить("Назначение", ТекСтрока.Назначение);
	ПараметрыФормы.Вставить("АдресТабСерииТоваров", ЗаполнитьТабСерииТоваров());

	ОповещениеЗакрытия = Новый ОписаниеОповещения("ТТМ_ПослеЗакрытияФормыСерий", ЭтотОбъект);

	ОткрытьФорму(
		"ОбщаяФорма.ТТМ_ВводСерийныхНомеровСДаннымиИзТЧ",
		ПараметрыФормы,
		ЭтаФорма,
		, , ,
		ОповещениеЗакрытия,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры


// Назначение: Обновляет таблицу серий и построчные статусы после закрытия формы серий.
// Параметры: Результат - Произвольный - Результат закрытия формы;
//             ДопПараметры - Произвольный - Дополнительные параметры оповещения.
&НаКлиенте
Процедура ТТМ_ПослеЗакрытияФормыСерий(Результат, ДопПараметры) Экспорт

	Если Результат = Истина Тогда
		ТТМ_ОбновитьТабИСтатусы();
		Элементы.Товары.Обновить();
	КонецЕсли;

КонецПроцедуры


// Назначение: Перечитывает серии из регистра и заново рассчитывает построчные статусы.
// Параметры: Нет
&НаСервере
Процедура ТТМ_ОбновитьТабИСтатусы()

// <data_processing>

	ЗаполнитьСерийныеномераПоРегистру();
	ТТМ_ЗаполнитьКолонкиСерийНаСервере();

КонецПроцедуры

#КонецОбласти
